SiliconLabs/wfx-fullMAC-tools/Examples/STM32/Drivers/wfx_fmac_driver/sl_wfx.c
    if (value32 != NCP_STATE_DOWNLOAD_PENDING) {
      status = SL_ERROR;
      SL_WFX_ERROR_CHECK(status);
    }

    /* loop until put - get <= 24K */
    for ( i = 0; i < 100; i++ ) {
      get = 0;
      status = sl_wfx_apb_read_32(ADDR_DWL_CTRL_AREA_GET, &get);
      SL_WFX_ERROR_CHECK(status);

      if ((put - get) <= (DOWNLOAD_FIFO_SIZE - DOWNLOAD_BLOCK_SIZE)) {
        break;
      }
    }

    if ((put - get) > (DOWNLOAD_FIFO_SIZE - DOWNLOAD_BLOCK_SIZE)) {
      status = SL_WIFI_FIRMWARE_DOWNLOAD_TIMEOUT;
      SL_WFX_ERROR_CHECK(status);
    }

    /* calculate the block size */
    uint32_t block_size = image_length - put;
    if (block_size > DOWNLOAD_BLOCK_SIZE) {
      block_size = DOWNLOAD_BLOCK_SIZE;
    }

    /* send the block to SRAM */
    status = sl_wfx_host_get_firmware_data(&buffer, block_size);
    SL_WFX_ERROR_CHECK(status);
    uint32_t block_address = ADDR_DOWNLOAD_FIFO_BASE + (put % DOWNLOAD_FIFO_SIZE);
    status = sl_wfx_apb_write(block_address, buffer, block_size);
    SL_WFX_ERROR_CHECK(status);

    /* update the put register */
    put += block_size;

    status = sl_wfx_apb_write_32(ADDR_DWL_CTRL_AREA_PUT, put);
    SL_WFX_ERROR_CHECK(status);
  }   /* End of firmware download loop */

  // notify NCP that upload ended
  status = sl_wfx_apb_write_32(ADDR_DWL_CTRL_AREA_HOST_STATUS, HOST_STATE_UPLOAD_COMPLETE);
  SL_WFX_ERROR_CHECK(status);

  // wait for authentication result
  status = sl_wfx_poll_for_value(ADDR_DWL_CTRL_AREA_NCP_STATUS, NCP_STATE_AUTH_OK, 100);
  SL_WFX_ERROR_CHECK(status);

  // notify NCP that we are happy to run firmware
  status = sl_wfx_apb_write_32(ADDR_DWL_CTRL_AREA_HOST_STATUS, HOST_STATE_OK_TO_JUMP);
  SL_WFX_ERROR_CHECK(status);

  error_handler:
  sl_wfx_host_deinit();

  return status;
}

/**************************************************************************//**
 * @brief Poll a value from the Wi-Fi chip
 *
 * @param address is the address of the value to be polled
 * @param polled_value waiting for the value to be equal to polled_value
 * @param max_retries is the number of polling to be done before returning
 * SL_TIMEOUT
 * @return SL_SUCCESS if the value is received correctly,
 * SL_TIMEOUT if the value is not found in time,
 * SL_ERROR if not able to poll the value from the Wi-Fi chip
 *****************************************************************************/
static sl_status_t sl_wfx_poll_for_value(uint32_t address, uint32_t polled_value, uint32_t max_retries)
{
  uint32_t    value;
  sl_status_t status = SL_SUCCESS;

  for (; max_retries > 0; max_retries--) {
    status = sl_wfx_apb_read_32(address, &value);
    SL_WFX_ERROR_CHECK(status);
    if (value == polled_value) {
      break;
    } else {
      sl_wfx_host_wait(1);
    }
  }
  if (value != polled_value) {
    status = SL_TIMEOUT;
  }

  error_handler:
  return status;
}

/**************************************************************************//**
 * @brief Compare the chip keyset and the firmware one to check compatibility
 *
 * @param chip_keyset is the value retrieved from the Wi-Fi chip
 * @param firmware_keyset is the 8 first bytes of the firmware
 * @return SL_SUCCESS if the firmware is compatible with the WF200,
 * SL_WIFI_INVALID_KEY otherwise
 *****************************************************************************/
static sl_status_t sl_wfx_compare_keysets(uint8_t chip_keyset, char *firmware_keyset)
{
  sl_status_t result;
  char        keyset_string[3];
  uint8_t     keyset_value;

  keyset_string[0] = *(firmware_keyset + 6);
  keyset_string[1] = *(firmware_keyset + 7);
  keyset_string[2] = '\0';
  keyset_value     = (uint8_t)strtoul(keyset_string, NULL, 16);

  if (keyset_value == chip_keyset) {
    result = SL_SUCCESS;
  } else {
    result = SL_WIFI_INVALID_KEY;
  }
  return result;
}

/**************************************************************************//**
 * @brief Configure the antenna setting (done through the PDS)
 *
 * @param config is the antenna configuration to be used.
 *   @arg         SL_WFX_ANTENNA_1_ONLY
 *   @arg         SL_WFX_ANTENNA_2_ONLY
 *   @arg         SL_WFX_ANTENNA_TX1_RX2
 *   @arg         SL_WFX_ANTENNA_TX2_RX1
 *   @arg         SL_WFX_ANTENNA_DIVERSITY
 * @return SL_SUCCESS if the setting is applied correctly, SL_ERROR otherwise
 *****************************************************************************/
sl_status_t sl_wfx_set_antenna_config(sl_wfx_antenna_config_t config)
{
  sl_status_t result;
  char        pds[32] = { 0 };
  char       *current = pds;

  current += sprintf(current, "{%c:{", PDS_ANTENNA_SEL_KEY);
  current += sprintf(current, "%c:%X,", PDS_KEY_A, (unsigned int) config);
  if (config == SL_WFX_ANTENNA_DIVERSITY) {
    // Set diversity mode internal, the Wi-Fi chip will control antenna allocation
    current += sprintf(current, "%c:%X}}", PDS_KEY_B, 1);
  } else {
    current += sprintf(current, "%c:%X}}", PDS_KEY_B, 0);
  }

  result = sl_wfx_send_configuration((const char *)pds, strlen(pds));
  SL_WFX_ERROR_CHECK(result);

  error_handler:
  return result;
}

/**************************************************************************//**
 * @brief Retrieve the hardware version and type
 *
 * @param revision is the pointer to retrieve the revision version
 * @param type is the pointer to retrieve the type
 * @return SL_SUCCESS if the values are retrieved correctly, SL_ERROR otherwise
 *****************************************************************************/
sl_status_t sl_wfx_get_hardware_revision_and_type(uint8_t *revision, uint8_t *type)
{
  uint32_t config_reg = 0;
  sl_status_t status  = SL_SUCCESS;

  status = sl_wfx_reg_read_32(SL_WFX_CONFIG_REG_ID, &config_reg);

  *type = (config_reg >> SL_WFX_CONFIG_TYPE_OFFSET) & SL_WFX_CONFIG_TYPE_MASK;
  *revision = (config_reg >> SL_WFX_CONFIG_REVISION_OFFSET) & SL_WFX_CONFIG_REVISION_MASK;
  return status;
}

/**************************************************************************//**
 * @brief Get the part opn
 *
 * @param opn
 * @return SL_SUCCESS if the values are retrieved correctly, SL_ERROR otherwise
 *****************************************************************************/
sl_status_t sl_wfx_get_opn(uint8_t **opn)
{
  sl_status_t status = SL_ERROR;

  if (sl_wfx_context != NULL) {
    *opn = (uint8_t *) &(sl_wfx_context->ineo_opn);
    status = SL_SUCCESS;
  }

  return status;
}

/**************************************************************************//**
 * @brief Allocate a buffer for the Wi-Fi driver
 *
 * @param buffer
 * @param command_id is the ID of the command to check if encryption is required
 * @param buffer_size is the size of the buffer to allocate
 * @param wait_duration_ms is the duration before returning SL_TIMEOUT
 * @return SL_SUCCESS if the values are retrieved correctly,
 * SL_TIMEOUT if the buffer is not allocated in time, SL_ERROR otherwise
 *****************************************************************************/
sl_status_t sl_wfx_allocate_command_buffer(sl_wfx_generic_message_t **buffer, uint32_t command_id, uint32_t buffer_size, uint32_t wait_duration_ms)
{
  SL_WFX_UNUSED_PARAMETER(command_id);
  return sl_wfx_host_allocate_buffer((void **)buffer,
                                     SL_WFX_CONTROL_BUFFER,
                                     buffer_size + SL_WFX_SECURE_LINK_HEADER_SIZE,
                                     wait_duration_ms);
}

/** @} end DRIVER_API */
